Repository: arkivverket/arkade5
Catalog: src/Arkivverket.Arkade.Core/Resources/ArkadeTestDisplayNames.*.resx
Languages: nb_no

# A_01
source: Number of records
nb_no: Antall poster

# A_02
source: Number of characters
nb_no: Antall tegn

# A_03
source: Longest and shortest record
nb_no: Lengste og korteste post

# A_04
source: Occurrences of record definitions
nb_no: Antall poster for posttype

# A_05
source: Frequency of codes in dataset
nb_no: Koder brukt i datasettet

# A_07
source: Number of null values in fields
nb_no: Antall null-verdi for felt

# A_08
source: Longest and shortest field value
nb_no: Lengste og korteste verdi for felt

# A_09
source: Lowest and highest field value
nb_no: Laveste og høyeste verdi for felt

# A_10
source: Occurrences of field value
nb_no: Antall forekomster av verdier for felt

# A_11
source: Control of specified length for all record types
nb_no: Kontroll av oppgitt lengde for alle posttyper

# A_12
source: Control of number of records
nb_no: Kontroll av antall poster

# A_13
source: Control of specified length for record type
nb_no: Kontroll av oppgitt lengde for posttype

# A_14
source: Control for record type being in use
nb_no: Kontroll om posttype benyttes

# A_15
source: Control of uniqueness of key
nb_no: Kontroll av unik nøkkel

# A_16
source: Control of foreign key
nb_no: Kontroll av fremmednøkkel

# A_17
source: Control of specified minimum length
nb_no: Kontroll av oppgitt minste lengde

# A_18
source: Control of specified maximum length
nb_no: Kontroll av oppgitt største lengde

# A_19
source: Control of field specified data format
nb_no: Kontroll av oppgitt dataformat for felt

# A_20
source: Control for null values in field
nb_no: Kontroll av null-verdier i felt

# A_21
source: Control of field value uniqeness
nb_no: Kontroll av unike verdier i felt

# A_22
source: Codes used in fields
nb_no: Kontroll av kode-verdier som benyttes i felt

# A_32
source: Control of field birth number
nb_no: Kontroll av fødselsnummer i felt

# A_33
source: Control of field organisation number
nb_no: Kontroll av organisasjonsnummer i felt

# A_34
source: Control of field account number
nb_no: Kontroll av kontonummer i felt

# A_35
source: Control of field date value
nb_no: Kontroll av dato i felt

# A_36
source: Control of field boolean value
nb_no: Kontroll av boolsk verdi i felt

# AH_01
source: Control of checksums
nb_no: Kontroll av sjekksummer

# AH_02
source: Control for extra/missing files
nb_no: Kontroll av ekstra / manglende filer

# AH_03
source: Control for invalid record delimiter or incorrect number of fields
nb_no: Kontroll av ugyldig postskille eller feil antall felter

# AI_01
source: Control of uniqueness of record key
nb_no: Kontroll av unik nøkkel for post

# N5_01
source: Control of existence of XML files
nb_no: Kontroll av eksistens for XML-filene

# N5_02
source: Validation of checksums
nb_no: Validering av sjekksummer

# N5_03
source: Validation of XML according to schema
nb_no: Validering av XML i henhold til skjema

# N5_04
source: Number of archives
nb_no: Antall arkiv

# N5_05
source: Number of archive parts
nb_no: Antall arkivdeler

# N5_06
source: Status for archive parts
nb_no: Status på arkivdeler

# N5_07
source: Number of classification systems
nb_no: Antall klassifikasjonssystem

# N5_08
source: Number of classes
nb_no: Antall klasser

# N5_09
source: Number of classes in main classification system without subclasses, folders or registrations
nb_no: Antall klasser i det primære klassifikasjonssystemet uten underklasser, mapper eller registreringer

# N5_10
source: Number of folders
nb_no: Antall mapper

# N5_11
source: Number of folders for each year
nb_no: Antall mapper for hvert år

# N5_12
source: Classes with both subclass(es) and folder(s)
nb_no: Klasser med både underklasse(r) og mappe(r)

# N5_13
source: Number of folders for each class
nb_no: Antall mapper for hver klasse

# N5_14
source: Number of folders without registrations or subfolders
nb_no: Antall mapper uten registreringer eller undermapper

# N5_15
source: Number of each different case folder status
nb_no: Antall av ulike saksmappestatuser

# N5_16
source: Number of registrations
nb_no: Antall registreringer

# N5_17
source: Number of each different journal record type
nb_no: Antall av ulike journalposttyper

# N5_18
source: Number of registrations for each year
nb_no: Antall registreringer for hvert år

# N5_19
source: Classes with both subclass(es) and registration(s)
nb_no: Klasser med både underklasse(r) og registrering(er)

# N5_20
source: Number of registrations for each class (not included registrations under folder)
nb_no: Antall registreringer for hver klasse (ikke medregnet registreringer under mappe)

# N5_21
source: Number of registrations without document description
nb_no: Antall registreringer uten dokumentbeskrivelse

# N5_22
source: Number of each different journal status
nb_no: Antall av ulike journalstatuser

# N5_23
source: Number of document descriptions
nb_no: Antall dokumentbeskrivelser

# N5_24
source: Number of document descriptions without document object
nb_no: Antall dokumentbeskrivelser uten dokumentobjekt

# N5_25
source: Number of each different document status
nb_no: Antall av ulike dokumentstatuser

# N5_26
source: Number of document objects
nb_no: Antall dokumentobjekter

# N5_27
source: Creation dates for the first and the last registration
nb_no: Opprettelsesdatoer for første og siste registrering

# N5_28
source: Control of number of document files
nb_no: Validering av antall dokumentfiler

# N5_29
source: Number of each different document format
nb_no: Antall av ulike dokumentformater

# N5_30
source: Control of document files' checksums
nb_no: Dokumentfilers sjekksummer

# N5_32
source: Control of existence of referenced documents
nb_no: Refererte dokumenters eksistens

# N5_33
source: Document files missing reference
nb_no: Dokumentfiler som mangler referanse

# N5_34
source: Document files referenced from more than one document object
nb_no: Dokumentfiler med referanse fra mer enn ett dokumentobjekt

# N5_35
source: Number of case parties
nb_no: Antall saksparter

# N5_35v5_0
source: Number of parties
nb_no: Antall parter

# N5_36
source: Number of remarks
nb_no: Antall merknader

# N5_37
source: Number of cross references
nb_no: Antall kryssreferanser

# N5_38
source: Number of precedents
nb_no: Antall presedenser

# N5_39
source: Number of correspondance parties
nb_no: Antall korrespondanseparter

# N5_40
source: Number of depreciations
nb_no: Antall avskrivninger

# N5_41
source: Number of document flows
nb_no: Antall dokumentflyter

# N5_42
source: Number of restricted entries
nb_no: Antall skjerminger

# N5_43
source: Number of security classifications
nb_no: Antall graderinger

# N5_44
source: Number of disposal resolutions
nb_no: Antall kassasjonsvedtak

# N5_45
source: Number of performed disposals
nb_no: Antall utførte kassasjoner

# N5_46
source: Number of converted documents
nb_no: Antall konverterte dokumenter

# N5_47
source: System identifications
nb_no: Systemidentifikasjoner

# N5_48
source: Archive part references
nb_no: Arkivdelreferanser

# N5_51
source: Class references
nb_no: Klassereferanser

# N5_59
source: Number of journal records
nb_no: Antall journalposter

# N5_60
source: Start and end dates
nb_no: Start- og sluttdatoer

# N5_61
source: Number of logged changes
nb_no: Antall loggførte endringer

# N5_62
source: Changelog references to archive structure
nb_no: Endringslogg-referanser til arkivstrukturen

# N5_63
source: Elements without content
nb_no: Elementer som mangler innhold

# N5_64
source: Number of empty document files
nb_no: Antall tomme dokumentfiler
