Repository: arkivverket/arkade5
Catalog: src/Arkivverket.Arkade.Core/Resources/Messages.*.resx
Languages: nb_no

# AnalyseAllFrequenceListDescription
source: Performs a frequency analysis on all fields with a defined codeset
nb_no: Utfører en frekvensanalyse for samtlige felt hvor det er definert et kodesett

# AnalyseAllFrequenceListMessage
source: {0} occurrences of {1}
nb_no: {0} forekomster av {1}

# AnalyseCountCharsDescription
source: Counts the number of characters in a file
nb_no: Teller opp antall tegn i en fil

# AnalyseCountCharsMessage
source: {0} characters
nb_no: {0} tegn

# AnalyseCountNullDescription
source: Counts the number of occurrences of null in the field
nb_no: Teller opp antall forekomster av verdien null i feltet

# AnalyseCountNullMessage
source: {0} occurrences of null
nb_no: {0} forekomster av null

# AnalyseCountRecordDefinitionOccurrencesDescription
source: Counts the number of records for each record type
nb_no: Teller opp antall poster for hver posttype

# AnalyseCountRecordDefinitionOccurrencesMessage
source: {0} records
nb_no: {0} poster

# AnalyseCountRecordsDescription
source: Counts the number of records in a file
nb_no: Teller opp antall poster i en fil

# AnalyseCountRecordsMessage
source: Total: {0} records
nb_no: Totalt: {0} poster

# AnalyseFindExtremeRecordsDescription
source: Finds the longest and shortest record for each record type
nb_no: Finner lengste og korteste post for hver posttype

# AnalyseFindExtremeRecordsMessage
source: Longest/shortest record: {0}/{1}
nb_no: Lengste/korteste post: {0}/{1}

# AnalyseFindExtremeValuesDescription
source: Finds the longest and shortest value in the field
nb_no: Finner lengste og korteste verdi i feltet

# AnalyseFindExtremeValuesMessage
source: Longest/shortest value: {0}/{1}
nb_no: Lengste/korteste verdi: {0}/{1}

# AnalyseFindMinMaxValueDescription
source: Finds the lowest and highest value in the field
nb_no: Finner laveste og høyeste verdi i feltet

# AnalyseFindMinMaxValueMessage
source: Lowest/highest value: {0}/{1}
nb_no: Laveste/høyeste verdi: {0}/{1}

# AnalyseFrequenceListDescription
source: Counts the number of occurrences of each value in the field
nb_no: Teller opp antall forekomster for hver verdi i feltet

# AnalyseFrequenceListMessage
source: {0} occurrences of {1}
nb_no: {0} forekomster av {1}

# ControlAccountNumberDescription
source: Control of control digits in an account number
nb_no: Kontroll av kontrollsifferne i et kontonummer

# ControlAccountNumberMessage
source: Invalid account number: {0}
nb_no: Ugyldig kontonummer: {0}

# ControlAllFixedLengthDescription
source: Validates given record lengths for all record types (fixed format only)
nb_no: Kontrollerer at oppgitt postlengde på samtlige posttyper er korrekt (kun fast format)

# ControlAllFixedLengthMessage
source: Mismatch between given record length ({0}) and actual record length ({1})
nb_no: Oppgitt postlengde ({0}) er ulik faktisk ({1})

# ControlBirthNumberDescription
source: Validation of the control digits in a birth number
nb_no: Kontroll av kontrollsifferne i et fødselsnummer

# ControlBirthNumberMessage
source: Invalid birth number: {0}
nb_no: Ugyldig fødselsnummer: {0}

# ControlBooleanValueDescription
source: Validates values in a boolean field
nb_no: Kontroll av verdiene i et boolsk felt

# ControlBooleanValueMessage
source: Found non-boolean values: {0}
nb_no: Følgende ikke-boolske verdier finnes: {0}

# ControlChecksumDescription
source: Checksum validation
nb_no: Kontroll av sjekksummer

# ControlChecksumMessage_ChecksumMismatch
source: Expected checksum: {0} Actual checksum: {1}
nb_no: Forventet sjekksum: {0} Aktuell sjekksum: {1}

# ControlChecksumMessage_ChecksumMissing
source: No checksum found in the ADDML file
nb_no: Ingen sjekksum funnet i ADDML-filen

# ControlChecksumMessage_UnknownChecksumAlgorithm
source: Unknown checksum algorithm: {0}
nb_no: Ukjent sjekksum-algoritme: {0}

# ControlCodesDescription
source: Validates that defined codes are used, and that used codes are defined in the codelist
nb_no: Kontrollerer om definerte koder benyttes og om det benyttes koder som ikke er definert i kodelisten

# ControlCodesMessage
source: Used codes not present in the codelist: {0}
nb_no: Ikke i kodelisten: {0}

# ControlDataFormatDescription
source: Validates given data format
nb_no: Kontrollerer om oppgitt dataformat er korrekt

# ControlDataFormatMessage
source: Invalid data format: {0}
nb_no: Ugyldig dataformat: {0}

# ControlDataFormatMessageExtension
source: + {0} more
nb_no: + {0} flere

# ControlDateValueDescription
source: Validation of date-field values
nb_no: Kontroll av verdiene i et dato-felt

# ControlDateValueMessage
source: Values not validated as date: {0}
nb_no: Verdier som ikke er dato: {0}

# ControlExtraOrMissingFilesDescription
source: Checks that existing files are defined in ADDML, and that files defined in ADDML are existing
nb_no: Kontrollerer om det finnes filer som ikke er definert i ADDML og omvendt

# ControlExtraOrMissingFilesMessage1
source: Present in ADDML but missing from archive
nb_no: Finnes i ADDML, men ikke i arkiv

# ControlExtraOrMissingFilesMessage2
source: Present in archive but missing from ADDML
nb_no: Finnes i arkiv, men ikke i ADDML

# ControlFixedLengthDescription
source: Validates given record length (fixed format only)
nb_no: Kontrollerer om oppgitt postlengde er korrekt (kun for fast format)

# ControlFixedLengthMessage
source: Mismatch between given record length ({0}) and actual record length ({1})
nb_no: Oppgitt postlengde ({0}) er ulik faktisk ({1})

# ControlForeignKeyDescription
source: Validates foreign keys
nb_no: Kontrollerer fremmednøkler for å sjekke at de går til en faktisk forekomst

# ControlForeignKeyMessage1
source: Invalid foreign key: The value [{0}] does not exist in the referred field {1}
nb_no: Ugyldig fremmednøkkel: Verdien [{0}] finnes ikke i det refererte feltet {1}

# ControlForeignKeyMessage1Combined
source: Invalid foreign key: The values [{0}] does not exist in the referred fields {1}
nb_no: Ugyldig fremmednøkkel: Verdiene [{0}] finnes ikke i de refererte feltene {1}

# ControlForeignKeyMessage2
source: Invalid foreign key: Can not find any values for the field {0}
nb_no: Ugyldig fremmednøkkel: Finner ingen verdier for feltet {0}

# ControlKeyDescription
source: Validates uniqueness of the key (primary eller alternate)
nb_no: Kontrollerer at nøkkelen (primary eller alternate) er unik

# ControlKeyMessage
source: The following primary key values are not unique: {0}
nb_no: Følgende primærnøkkelverdier er ikke unike: {0}

# ControlMaxLengthDescription
source: Checks whether the stated maximum length is actually the largest length in the field
nb_no: Kontrollerer om oppgitt største lengde faktisk er største lengde i feltet

# ControlMaxLengthMessage
source: Values longer than the maximum length: {0}
nb_no: Verdier lengre enn maksimumlengde: {0}

# ControlMinLengthDescription
source: Checks whether the stated minimum length is actually the smallest length in the field
nb_no: Kontrollerer om oppgitt minste lengde faktisk er minste lengde i feltet

# ControlMinLengthMessage
source: Values smaller than the minimum length: {0}
nb_no: Verdier kortere enn minstelengde: {0}

# ControlNotNullDescription
source: Checks the field for null-values
nb_no: Kontrollerer om det fines null-verdier i feltet

# ControlNotNullMessage
source: NULL values exists
nb_no: NULL-verdier finnes

# ControlNotUsedRecordDefDescription
source: Checks if this record type is used in the dataset
nb_no: Kontrollerer om denne posttypen benyttes i datasettet

# ControlNotUsedRecordDefMessage
source: The record type is not in use
nb_no: Posttypen er ikke i bruk

# ControlNumberOfRecordsDescription
source: Counts and checks that the number of records in the file is equal to the number specified in the numberOfRecords property in flatFile
nb_no: Teller opp og kontrollerer at antall poster i filen er lik antallet som er oppgitt i egenskapen numberOfRecords i flatFile

# ControlOrganizationNumberDescription
source: Validation of the control digits in an organisation number
nb_no: Kontroll av kontrollsifferne i et organisasjonsnummer

# ControlOrganizationNumberMessage
source: Invalid organisation number: {0}
nb_no: Ugyldig organisasjonsnummer: {0}

# ControlUniquenessDescription
source: Validates uniqueness of the values in the field
nb_no: Kontrollerer om verdiene i feltet er unike

# ControlUniquenessMessage1
source: All values are unique
nb_no: Alle verdier er unike

# ControlUniquenessMessage2
source: {0} is not a unique value
nb_no: {0} er ikke en unik verdi

# ExceptionFixedLengthSumIsNotCorrect
source: {0}: The number of characters in the FixedLength field [{1}] does not match the number of characters summed for the record definition [{2}].
nb_no: {0}: Antall tegn i FixedLength-feltet [{1}] stemmer ikke med antall tegn summert for postdefinisjonen [{2}].

# ExceptionReadingAddmlFile
source: Error while loading ADDML. {0}
nb_no: Feil ved innlesing av ADDML. {0}

# LogMessageFinishedTesting
source: Testing of archive completed.
nb_no: Testing av arkivet er fullført.

# LogMessageStartTesting
source: Starting testing of archive.
nb_no: Starter testing av arkivet.

# NumberOfRecordsWithFieldDelimiterErrorDescription
source: Summary of the number of records with errors associated with field separator and/or record separator.
nb_no: Oppsummering av antall poster som har feil tilknyttet feltseparator og/eller postseparator.

# ReadingArchiveEvent
source: Reading archive
nb_no: Innlesing av arkiv

# ReadingArchiveEventFinishedMessage
source: Archive is loaded.
nb_no: Arkivet er lest inn.

# RunningAddmlProcessesOnFile
source: ADDML processes on the file: {0}
nb_no: ADDML-prosesser på filen: {0}

# TarExtractionEvent
source: Archive extraction
nb_no: Utpakking av arkiv

# TarExtractionMessageFinished
source: Archive is extracted to {0}
nb_no: Arkivet er pakket ut til {0}

# TarExtractionMessageStarted
source: Starting extraction.
nb_no: Starter utpakking.

# ValidatingExtractMessage
source: Validating extract
nb_no: Validerer uttrekket

# LineTraceMessage
source: {0} - line(s): {1}
nb_no: {0} - linje(r): {1}

# Noark4ValidationNotSupported
source: Validation of Noark4-extracts is not supported
nb_no: Validering av Noark4-uttrekk er ikke støttet

# PdfAValidationEventId
source: PDF/A validation
nb_no: PDF/A-validering
