Repository: arkivverket/arkade5
Catalog: src/Arkivverket.Arkade.Core/Resources/Noark5Messages.*.resx
Languages: nb_no

# ArchivepartReferenceControlMessage
source: Reference from {0} (systemID) {1} to archive part (systemID) {2} is not valid
nb_no: Referanse fra {0} (systemID) {1} til arkivdel (systemID) {2} er ikke gyldig

# ArchivePartSystemId
source: Archive part (systemID, title): {0}, {1}
nb_no: Arkivdel (systemID, tittel): {0}, {1}

# ArchiveStartAndEndDateControlMessage_DatesArchive
source: Start and end date in the archive structure: {0} - {1}
nb_no: Start- og sluttdato i arkivstrukturen: {0} - {1}

# ArchiveStartAndEndDateControlMessage_DatesPublicJournal
source: Public journal start and end date: {0} - {1}
nb_no: Start- og sluttdato i offentlig journal: {0} - {1}

# ArchiveStartAndEndDateControlMessage_DatesRunningJournal
source: Start and end date in running journal: {0} - {1}
nb_no: Start- og sluttdato i løpende journal: {0} - {1}

# ArchiveStartAndEndDateControlMessage_NoArchiveDatesFound
source: No valid journal dates were found in the archive extract
nb_no: Det ble ikke funnet noen gyldige journaldatoer i arkivuttrekket

# ArchiveStartAndEndDateControlMessage_UnEqualJournalAndArchiveDates
source: Period separation is sharp and dates in the archive structure are not similar to those in public and rolling journal
nb_no: Periodeskille er skarpt og datoer i arkivstrukturen er ikke like de i offentlig og løpende journal

# ArchiveStartAndEndDateControlMessage_UnEqualJournalDates
source: Dates in public and rolling journals are not equal
nb_no: Datoer i offentlig og løpende journal er ikke like

# ChangeLogArchiveReferenceControlMessage
source: Reference to archive unit is not valid: (systemID) {0}
nb_no: Referanse til arkivenhet er ikke gyldig: (systemID) {0}

# ClassReferenceControlMessage
source: Folder reference (systemID) {0} to class (systemID) {1} is not valid
nb_no: Referanse fra mappe (systemID) {0} til klasse (systemID) {1} er ikke gyldig

# ControlElementHasContent_AfterSystemId
source: After systemID {0}
nb_no: Etter systemID {0}

# ControlElementHasContent_ElementHasNoContent
source: The element {0} has no content
nb_no: Elementet {0} mangler innhold

# ControlNoSuperclassesHasFoldersMessage
source: Class with systemID {0}
nb_no: Klasse med systemID {0}

# ControlNoSuperclassesHasRegistrationsMessage
source: Class with systemID {0}
nb_no: Klasse med systemID {0}

# CouldNotReadFromFiles
source: Could not read from one or more files
nb_no: Kunne ikke lese fra en eller flere filer

# DatesFirstAndLastRegistrationMessage_CreationDateFirstRegistration
source: First registration: Created {0}
nb_no: Første registrering: Opprettet {0}

# DatesFirstAndLastRegistrationMessage_CreationDateLastRegistration
source: Last registration: Created {0}
nb_no: Siste registrering: Opprettet {0}

# DatesFirstAndLastRegistrationMessage_NoValidRegistrationCreationDates
source: No valid registration creation dates found
nb_no: Ingen gyldige datoer for registreringsopprettelse funnet

# DatesFirstAndLastRegistrationMessage_NumberOfInvalidRegistrationCreationDates
source: Number of invalid registration creation dates found: {0}
nb_no: Antall ugyldige datoer for registreringsopprettelse funnet: {0}

# DatesFirstAndLastRegistrationMessage_NumberOfRegistrations
source: Total: {0}
nb_no: Totalt: {0}

# DocumentFilesChecksumControlMessage
source: The file {0} does not have the same checksum as specified in document description (systemID) {1}
nb_no: Filen {0} har ikke samme sjekksum som oppgitt i dokumentbeskrivelse (systemID) {1}

# DocumentfilesReferenceControlMessage
source: Non-referenced file found: {0}
nb_no: Ikke-referert fil funnet: {0}

# ExceptionDuringXmlValidation
source: There was a problem while validating {0}: {1}
nb_no: Det oppsto et problem under validering av {0}: {1}

# ExceptionInvalidChecksum
source: Unexpected checksum for file: {0} Expected: {1} Generated: {2}
nb_no: Sjekksummen stemmer ikke for filen: {0} Forventet: {1} Generert: {2}

# FileNotFound
source: The file {0} was not found
nb_no: Filen {0} ble ikke funnet

# InternalSchemaFileIsUsed
source: Schema file {0} is not correctly documented in the extract. Arkade will be using the built-in version {1} of {0}.
nb_no: Skjemafil {0} er ikke korrekt dokumentert i uttrekket. Arkade bruker derfor innebygd versjon {1} av {0}.

# JournalPostRegistrationCount
source: Journal entry registrations: {0}
nb_no: Journalpostregistreringer: {0}

# MeetingRegistrationCount
source: Meeting registrations: {0}
nb_no: Møteregistreringer: {0}

# NumberOf_PerArchivePart
source: Archive part (systemID - title) {0} - {1}: {2}
nb_no: Arkivdel (systemID - tittel) {0} - {1}: {2}

# NumberOfArchivePartsMessage_ArchivepartsInArchive
source: Number of archive parts in archive (systemID) {0}: {1}
nb_no: Antall arkivdeler i arkiv (systemID) {0}: {1}

# NumberOfArchivesMessage_ArchivesAtLevel
source: Number of archives at level {0}: {1}
nb_no: Antall arkiv på nivå {0}: {1}

# NumberOfClasses
source: Number of classes: {0}
nb_no: Antall klasser: {0}

# NumberOfClassesPerLevel
source: Classes at level {0}: {1}
nb_no: Klasser på nivå {0}: {1}

# NumberOfClassificationsMessage
source: Security classifications in {0} - Number: {1}
nb_no: Graderinger i {0} - Antall: {1}

# NumberOfClassificationSystemsMessage_ClassificationSystemInArchivePart
source: Number of classification systems in {0}: {1}
nb_no: Antall klassifikasjonssystemer i {0}: {1}

# NumberOfCommentsMessage
source: Number of comments in {0}: {1}
nb_no: Antall merknader i {0}: {1}

# NumberOfCrossReferencesToBasicRegistrationMessage
source: Number of cross-references from base registrations: {0}
nb_no: Antall kryssreferanser fra basisregistreringer: {0}

# NumberOfCrossReferencesToClassMessage
source: Number of cross-references from classes: {0}
nb_no: Antall kryssreferanser fra klasser: {0}

# NumberOfCrossReferencesToFolderMessage
source: Number of cross-references from folders: {0}
nb_no: Antall kryssreferanser fra mapper: {0}

# NumberOfDisposalResolutionsMessage
source: Disposal resolutions in {0} - Number: {1}
nb_no: Kassasjonsvedtak i {0} - Antall: {1}

# NumberOfDisposalResolutionsMessage_DocFalseActualTrue
source: The archive extract is specified with no disposal resolutions, but disposal resolutions were found
nb_no: Det er angitt at uttrekket ikke skal inneholde kassasjonsvedtak, men kassasjonsvedtak ble funnet

# NumberOfDisposalResolutionsMessage_DocTrueActualFalse
source: The archive extract is specified with disposal resolutions, but no disposal resolutions were found
nb_no: Det er angitt at uttrekket skal inneholde kassasjonsvedtak, men ingen kassasjonsvedtak ble funnet

# NumberOfDisposalsExecutedMessage_DocFalseActualTrue
source: It is documented that the archive extract shall not include performed disposals, but performed disposals were found
nb_no: Det er dokumentert at uttrekket ikke skal omfatte utførte kassasjoner, men utførte kassasjoner ble funnet

# NumberOfDisposalsExecutedMessage_DocTrueActualFalse
source: It is documented that the archive extract shall include performed disposals, but no performed disposals were found
nb_no: Det er dokumentert at uttrekket skal omfatte utførte kassasjoner, men ingen utførte kassasjoner ble funnet

# NumberOfEachCaseFolderStatusMessage
source: Case folder status: {0} - Number: {1}
nb_no: Saksmappestatus: {0} - Antall: {1}

# DocumentFormatMessage
source: Document format: {0}
nb_no: Dokumentformat: {0}

# NumberOfEachDocumentFormatMessage_FormatMismatch
source: Format mismatch: Document file reference: {0}
nb_no: Format-misforhold: Dokumentfilreferanse: {0}

# NumberOfEachDocumentStatusMessage
source: Document status: {0} - Number: {1}
nb_no: Dokumentstatus: {0} - Antall: {1}

# NumberOfEachJournalPostTypeMessage_MissingMainDocument
source: Journal entry with systemID {0} is missing main document
nb_no: Journalpost med systemID {0} mangler hoveddokument

# NumberOfEachJournalPostTypeMessage_TypeAndCount
source: Journal entry type: {0} - Quantity: {1}
nb_no: Journalposttype: {0} - Antall: {1}

# NumberOfEachJournalStatusMessage
source: Journal status: {0} - Number: {1}
nb_no: Journalstatus: {0} - Antall: {1}

# NumberOfEmptyClassesInMainClassificationSystem
source: Classification system (systemID) {0}: {1}
nb_no: Klassifikasjonssystem (systemID) {0}: {1}

# NumberOfFolders_DocumentedAndActualMismatch
source: The archive structure is specified with {0} folders but {1} was found
nb_no: Det er angitt at arkivstrukturen skal innholde {0} mapper men {1} ble funnet

# NumberOfFoldersPerClassMessage_NumberOfClassesWithoutFolders
source: Classes without folders (and without subclasses) - Number: {0}
nb_no: Klasser uten mapper (og uten underklasser) - Antall: {0}

# NumberOfFoldersPerClassMessage_NumberOfFolders
source: Class (systemID) {0} - Number: {1}
nb_no: Klasse (systemID) {0} - Antall: {1}

# NumberOfJournalPostsMessage_CouldNotReadFromJournals
source: Could not read from one or more journal files
nb_no: Kunne ikke lese fra en eller flere journalfiler

# NumberOfJournalPostsMessage_NumberOfJournalPostsFound
source: Number of journal entries found in the archive structure: {0}
nb_no: Antall journalposter funnet i arkivstrukturen: {0}

# NumberOfJournalPostsMessage_NumberOfJournalPostsInPublicJournal
source: Number of journal entries documented in public journal: {0}
nb_no: Antall journalposter dokumentert i offentlig journal: {0}

# NumberOfJournalPostsMessage_NumberOfJournalPostsInRunningJournal
source: Number of journal entries documented in rolling journal: {0}
nb_no: Antall journalposter dokumentert i løpende journal: {0}

# NumberOfJournalPostsMessage_UnEqualJournalAndArchiveNumbers
source: Period separator is sharp and the number of journal entries in the archive structure is not equal to that in public and rolling journal
nb_no: Periodeskille er skarpt og antallet journalposter i arkivstrukturen er ikke likt det i offentlig og løpende journal

# NumberOfJournalPostsMessage_UnEqualJournalNumbers
source: The number of journal entries in public and rolling journals are different
nb_no: Antallet journalposter i offentlig og løpende journal er ulikt

# NumberOfMultiReferencedDocumentFilesMessage
source: Referenced document file: {0} - Number of References: {1}
nb_no: Referert dokumentfil: {0} - Antall referanser: {1}

# NumberOfPrecedentsInCaseFolderMessage
source: Number of precedents in case folders: {0}
nb_no: Antall presedenser i saksmapper: {0}

# NumberOfPrecedentsInJournalpostsMessage
source: Number of precedents in journal entries: {0}
nb_no: Antall presedenser i journalposter: {0}

# NumberOfRegistrations_DocumentedAndActualMismatch
source: The archive structure is specified with {0} registrations, but {1} was found
nb_no: Det er angitt at arkivstrukturen skal innholde {0} registreringer, men {1} ble funnet

# NumberOfRegistrationsPerClassMessage_NumberOfClassesWithoutRegistrations
source: Classes without registrations (and without subclasses) - Number: {0}
nb_no: Klasser uten registreringer (og uten underklasser) - Antall: {0}

# NumberOfRestrictionsMessage
source: Restrictions in {0} - Number: {1}
nb_no: Skjerminger i {0} - Antall: {1}

# NumberOfRestrictionsMessage_DocFalseActualTrue
source: The archive extract is specified with no restricted entries, but restricted entries were found
nb_no: Det er angitt at uttrekket ikke skal inneholde skjerminger, men skjerminger ble funnet

# NumberOfRestrictionsMessage_DocTrueActualFalse
source: The archive extract is specified with restricted entries, but no restricted entries were found
nb_no: Det er angitt at uttrekket skal inneholde skjerminger, men ingen skjerminger ble funnet

# FolderType
source: Folder type: {0}
nb_no: Mappetype: {0}

# NumberOfTypeFoldersAtLevel
source: Number at level {0}: {1}
nb_no: Antall på nivå {0}: {1}

# NumberOfTypeRegistrations
source: Registration type: {0} - Number: {1}
nb_no: Registreringstype: {0} - Antall: {1}

source: Primary
nb_no: Primært

source: Secondary
nb_no: Sekundært

# StatusOfArchivePartsMessage
source: Status of archive part: {0}
nb_no: Arkivdelstatus: {0}

# SystemIdUniqueControlMessage
source: Non-unique ID: System identification (systemID) {0} occurs {1} times
nb_no: Ikke-unik ID: Systemidentifikasjonen (systemID) {0} forekommer {1} ganger

# TotalResultNumber
source: Total: {0}
nb_no: Totalt: {0}

# ValidateNumberOfDocumentfilesMessage_DocumentationNotFound
source: Number of document files were not found specified
nb_no: Antall dokumentfiler ble ikke funnet oppgitt

# ValidateNumberOfDocumentfilesMessage_FileAndDocumentationMismatch
source: Mismatch between the specified and the actual number of document files
nb_no: Det er ikke samsvar mellom oppgitt antall og faktisk antall dokumentfiler

# ValidateNumberOfDocumentfilesMessage_FilesDirectoryNotFound
source: No document file directory found
nb_no: Ingen dokumentfilkatalog funnet

# ValidateNumberOfDocumentfilesMessage_NoFilesFound
source: No document files found
nb_no: Ingen dokumentfiler funnet

# ValidateNumberOfDocumentfilesMessage_NumberOfFilesDocumented
source: Specified number of document files: {0}
nb_no: Oppgitt antall dokumentfiler: {0}

# ValidateNumberOfDocumentfilesMessage_NumberOfFilesFound
source: Number of document files found: {0}
nb_no: Antall dokumentfiler funnet: {0}

# ValidateStructureFileExists_FileMissing
source: The file {0} is listed in the archive extract, but is missing in the package
nb_no: Filen {0} er listet opp i arkivuttrekket, men mangler i pakke

# ChecksumAlgorithmMessage
source: Algorithm used for checksum validation: {0}
nb_no: Algoritme brukt til sjekksum-validering: {0}

# Noark5VersionNotSupportedForBuiltInSchemas
source: Arkade does not support built-in schemas for Noark5 version {0}
nb_no: Arkade støtter ikke innebygde skjema for Noark5 versjon {0}

# MissingAddmlSchema
source: Missing "addml.xsd"
nb_no: Mangler "addml.xsd"

# UsingBuiltInAddmlSchemaFile
source: Could not find "addml.xsd" in the extract. Built in version ({0}) will be used.
nb_no: Kunne ikke finne "addml.xsd" i uttrekket. Innebygd versjon ({0}) brukes.

# NumberOf
source: Number: {0}
nb_no: Antall: {0}

# NumberOfDocumentsWithFormatMismatch
source: Number of documents with format mismatch: {0}
nb_no: Antall dokumenter med format-misforhold: {0}

# NumberOfUniqueDocumentFormats
source: Total number of unique formats: {0}
nb_no: Totalt antall unike formater: {0}

# StatusOfArchivePartsMessage_ForArchivePart
source: Status of {0}: {1}
nb_no: Status for {0}: {1}

# ClassSystemId
source: Class (SystemID) {0}
nb_no: Klasse (SystemID) {0}

# ClassificationSystemTypeAndId
source: {0} classification system (systemID): {1}
nb_no: {0} klassifikasjonssystem (systemID): {1}

# CouldNotFindValidSpecificationFile
source: Could not find a valid specification file
nb_no: Klarte ikke finne en gyldig spesifikasjonsfil

# FolderSystemIdAndFolderId
source: Folder (systemID, mappeID): {0}, {1}
nb_no: Mappe (systemID, mappeID): {0}, {1}

# RegistrationSystemIdAndRegistrationId
source: Registration (systemID, registreringsID): {0}, {1}
nb_no: Registrering (systemID, registreringsID): {0}, {1}

# DocumentDescriptionSystemIdRegistrationIdAndDocumentNumber
source: Document description (systemID, registreringsID, dokumentnummer): {0}, {1}, {2}
nb_no: Dokumentbeskrivelse (systemID, registreringsID, dokumentnummer): {0}, {1}, {2}

# DocumentDescriptionsWithoutDocumentObjectsAndPhysicalStorage
source: In addition, {0} document descriptions without document objects and a physical storage medium were found.
nb_no: I tillegg ble det funnet {0} dokumentbeskrivelser uten dokumentobjekt der lagringsmedium er "fysisk arkiv" eller "fysisk medium".

# DocumentDescriptionsWithoutDocumentObjectsInfoMessage
source: The following cases are not included in the total count: Document descriptions which are subject to a folder or registration with status "utgår". Document descriptions where "dokumentmedium" is "fysisk medium" or "fysisk arkiv".
nb_no: Følgende tilfeller er ikke inkludert i totalen: Dokumentbeskrivelser som er underlagt mapper eller registreringer med status "utgår". Dokumentbeskrivelser der "dokumentmedium" er "fysisk medium" eller "fysisk arkiv".
